Revit 2026 API

# ConnectorElementAssignAsPrimary Method

---

Assign a connector as a primary connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AssignAsPrimary()
```
```vb
Public Sub AssignAsPrimary
```
```cpp
public:
void AssignAsPrimary()
```
```fsharp
member AssignAsPrimary : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when fail to assign this connector as primary. |

This method is used to promote this connector as primary, and the rest of connectors in this system will be assigned as secondary.

#### Reference

ConnectorElement Class

Autodesk.Revit.DB Namespace